/******************************************************************************
*@copyright  Copyright(c) 2024 RXHK.Co.,Ltd.
*@file       ipc_data_drv.h
*@author     jinyangh
*@date       2026.07.09
*@brief
*@par        History
*Date        Version   Author     Description
*2026.07.09  1.0       jinyangh    example
******************************************************************************/
#ifndef _IPC_DATA_DRV_H
#define _IPC_DATA_DRV_H

#ifdef __cplusplus
extern "C" {
#endif

/*---------------------------------------------------------------------------*/
/*                           Include Files                                   */
/*---------------------------------------------------------------------------*/
#include "platform.h"
/*---------------------------------------------------------------------------*/
/*                      Definition of constants                              */
/*---------------------------------------------------------------------------*/
#define  IPC_DATA_DRV_NUM                 (32 * 1024)    // 32K
/*---------------------------------------------------------------------------*/
/*                      Definition of datatype                               */
/*---------------------------------------------------------------------------*/
typedef enum
{
    r0 = 0,
    r1 = 1,
    r2 = 2,
    r3 = 3,
    c60 = 4,
    c61 = 5,
    c70 = 6,
    mcu1 = 7,
    core_type_num,
}core_type;
/*---------------------------------------------------------------------------*/
/*                      Definition of interface                              */
/*---------------------------------------------------------------------------*/
/*
 * 各个核共享内存分配说明（只关注写，不能写到同一个地址，读不关心）
 * R0：
 *
 *
 * R1：
 * 0~255Byte：用于存放本核可视化工程的信息
 * 256~767Byte：用于存放本核相关的版本信息
 *
 * R2：
 * 0~255Byte：用于存放本核可视化工程的信息
 * 256~767Byte：用于存放本核相关的版本信息
 * 768~771Byte：用于存放本核可视化算法块配置完成的标志
 *
 * R3：
 * 0~255Byte：用于存放本核可视化工程的信息
 * 256~767Byte：用于存放本核相关的版本信息
 * 768~771Byte：用于存放本核可视化算法块配置完成的标志
 * 772~5891Byte：用于存放本核的FT3发送配置相关数据，预留5K空间
 * 5892~11011Byte：用于存放本核的FT3接收配置相关数据，预留5K空间
 *
 * C6x0：
 * 0~255Byte：用于存放本核可视化工程的信息
 * 256~767Byte：用于存放本核相关的版本信息
 * 768~771Byte：用于存放本核可视化算法块配置完成的标志
 * 772~5891Byte：用于存放本核的FT3发送配置相关数据，预留5K空间
 * 5892~11011Byte：用于存放本核的FT3接收配置相关数据，预留5K空间
 *
 * C6x1：
 * 0~255Byte：用于存放本核可视化工程的信息
 * 256~767Byte：用于存放本核相关的版本信息
 * 768~771Byte：用于存放本核可视化算法块配置完成的标志
 *
 * C7x0：
 * 0~255Byte：用于存放本核可视化工程的信息
 * 256~767Byte：用于存放本核相关的版本信息
 * 768~771Byte：用于存放本核可视化算法块配置完成的标志
 *
 * MCU1：
 * 0~255Byte：用于存放本核可视化工程的信息
 * 256~767Byte：用于存放本核相关的版本信息
 * 768~771Byte：用于存放本核可视化算法块配置完成的标志
 * */



bool         ipc_data_drv_write(uint32_t position, const uint8_t *buf, uint32_t num);
bool         ipc_data_drv_read(core_type core_id, uint32_t position, uint8_t *buf, uint32_t num);
#ifdef __cplusplus
}
#endif /* __cplusplus */
#endif /* _IPC_DATA_DRV_H */
