/******************************************************************************
*@copyright  Copyright(c) 2025 RXHK.Co.,Ltd.
*@file       crc16.h
*@author     xuesen
*@date       2026.05.06
*@brief      CCITT CRC16校验接口定义。
*@par        History
*Date        Version   Author     Description
*2026.05.06  1.0       xuesen     Initial version
******************************************************************************/

#ifndef  __NET_CRC16__INCLUDE__
#define  __NET_CRC16__INCLUDE__

/*---------------------------------------------------------------------------*/
/*                           Include Files                                   */
/*---------------------------------------------------------------------------*/

/*---------------------------------------------------------------------------*/
/*                      Definition of constants                              */
/*---------------------------------------------------------------------------*/

#define COMPUTE(crc, ch) (crc) = (crc_table[(((crc)>>8) ^ (ch)) & 0xFF] ^ ((crc) << 8))

/*---------------------------------------------------------------------------*/
/*                      Definition of datatype                               */
/*---------------------------------------------------------------------------*/

/*---------------------------------------------------------------------------*/
/*                      Definition of interface                              */
/*---------------------------------------------------------------------------*/

/**
 * @brief 计算缓冲区的 CCITT CRC16 校验值。
 * @param buffer 待计算的数据缓冲区
 * @param len 数据长度，单位为字节
 * @param crc 初始 CRC 值
 * @return CRC16 校验结果
 */


unsigned short crc_ccitt(const void *buffer, unsigned int len, unsigned short crc);

#endif